import React from 'react'
import { Mainlayouts } from "@/components";
import { PdpaContainer } from "./styled";
const pdpa = () => {
    return (
        <Mainlayouts.NavAndFooterWithBanner>
            <PdpaContainer>
                <div className='pdpa-container'>
                    <div className="pdpa">นโยบายความเป็นส่วนตัว</div>
                    <div className="pdpa-content">นโยบายความเป็นส่วนตัวนี้เป็นข้อตกลงระหว่างคุณไม่ว่าจะเป็นการส่วนตัวหรือในนามหน่วยงาน ซึ่งต่อไปนี้จะเรียกว่า "ผู้ใช้บริการ" และ OverTopup ซึ่งต่อไปนี้จะเรียกว่า "บริษัท" เพื่อใช้บริการแพลตฟอร์ม OverTopup.Com ซึ่งต่อไปนี้จะเรียกว่า "บริการ" โดยตระหนักถึงความสำคัญและหน้าที่ภายใต้ พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562</div>

                    <div className='pdpa-enforcement-container'>
                        <div className="pdpa-enforcement">การบังคับใช้</div>
                        <div className="pdpa-enforcement-content">นโยบายความเป็นส่วนตัวนี้ครอบคลุมถึงข้อมูลส่วนตัวของผู้ใช้บริการ รวมถึงบุคคลที่ดำเนินการในนามนิติบุคคลซึ่งเป็นเจ้าของข้อมูลส่วนบุคคล เช่น กรรมการ ที่ปรึกษา คณะผู้บริหาร และ/หรือบุคคลใด ๆ ที่มีความเกี่ยวข้องกับบุคลลากรของบริษัท "ผู้ใช้บริการ" หมายถึงบุคคลที่เป็นเป้าหมายในการดำเนินงานขายผลิตภัณฑ์หรือบริการของบริษัท และหมายความรวมถึง ผู้เข้าร่วมแคมเปญหรือกิจกรรมทางการตลาดของบริษัท ผู้ให้ความสนใจผลิตภัณฑ์หรือบริการของบริษัทผ่านช่องทางต่าง ๆ และ/หรือ ผู้ใช้บริการต่าง ๆ ของบริษัทผ่านสื่อออนไลน์และสื่ออิเล็กทรอนิกส์ต่าง ๆ แล้วแต่กรณี รวมถึงผู้มีอำนาจดำเนินการแทนลูกค้าตามกฎหมาย แล้วแต่กรณี เช่น ผู้ใช้อำนาจปกครองของผู้เยาว์ ผู้อนุบาลของผู้ไร้ความสามารถ ผู้พิทักษ์ของผู้เสมือนไร้ความสามารถ เป็นต้น</div>
                    </div>

                    <div className='pdpa-personal-info-container'>
                        <div className="pdpa-personal-info">ข้อมูลส่วนบุคคล</div>
                        <div className="pdpa-personal-info-content">ข้อมูลส่วนบุคคลหมายถึงข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวตนบุคคลนั้นได้ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ เช่น ชื่อ นามสกุล ที่อยู่ หมายเลขโทรศัพท์ เลขประจำตัวประชาชน เลขบัตรประกันสังคม เลขประจำตัวผู้เสียภาษี ที่อยู่อีเมล (email-address) IP Address, Cookie ID, Log File เป็นต้น แต่อย่างไรก็ดีข้อมูลดังต่อไปนี้ไม่ใช่ข้อมูลส่วนบุคคล เช่น ข้อมูลการติดต่อทางธุรกิจที่ไม่มีการระบุถึงตัวบุคคล ชื่อบริษัท ที่อยู่ของบริษัท เลขทะเบียนนิติบุคคล หมายเลขโทรศัพท์ที่ทำงาน ที่อยู่อีเมลที่ใช้ในการทำงาน หรือที่อยู่อีเมล์ของกลุ่มบริษัท ข้อมูลนิรนาม หรือข้อมูลแฝงที่ไม่สามารถระบุตัวตนได้ และ/หรือข้อมูลผู้ถึงแก่กรรม เป็นต้น</div>
                        <br />
                        <div className='pdpa-personal-info-content'>ทั้งนี้ ต่อไปในประกาศความเป็นส่วนตัวฉบับนี้ หากไม่มีการกล่าวโดยเฉพาะเจาะจงจะเรียก “ข้อมูลส่วนบุคคล” และ “ข้อมูลส่วนบุคคลที่ละเอียดอ่อน” ที่เกี่ยวกับผู้ใช้บริการข้างต้นให้รวมกันเรียกว่า “ข้อมูลส่วนบุคคล”</div>
                        <br />
                        <div className='pdpa-personal-info-content'>ในกรณีที่บริษัทได้รับสำเนาบัตรประจำตัวประชาชนของท่าน เพื่อวัตถุประสงค์ในการพิสูจน์ตัวตนในการก่อนิติสัมพันธ์ทางกฎหมาย และ/หรือการทำธุรกรรมใด ๆ กับบริษัท บริษัทไม่มีนโยบายการเก็บรวบรวมข้อมูลที่มีความละเอียดอ่อน (Sensitive Data) อาทิ ข้อมูลศาสนา ยกเว้นในกรณีที่บริษัทได้รับความยินยอมจากท่าน ทั้งนี้บริษัทจะกำหนดวิธีการจัดการตามแนวทางปฏิบัติและเป็นไปตามที่กฎหมายอนุญาต</div>
                    </div>
                    <div className='pdpa-data-collection-container'>
                        <div className='pdpa-data-collection-title'>บริษัทจะจัดเก็บข้อมูลของคุณเมื่อ</div>
                        <ol className="data-collection-list">
                            {PDPA_DATA.map((item, index) => (
                                <li key={index} className="data-collection-list__item">
                                    {item}
                                </li>
                            ))}
                        </ol>
                    </div>
                </div>
            </PdpaContainer>
        </Mainlayouts.NavAndFooterWithBanner>
    )
}


const PDPA_DATA = [
    "ผู้ใช้บริการได้เข้าถึงและ/หรือใช้บริการบนแพลตฟอร์มของบริษัท หรือลงทะเบียน และ/หรือสมัครบัญชีสำหรับใช้บริการกับบริษัท",
    "เมื่อผู้ใช้บริการส่งแบบฟอร์ม หรือสมัครใช้บริการใดๆ บนแพลตฟอร์มของบริษัท ไม่ว่าจะเป็นทางออนไลน์หรือรูปแบบเอกสาร",
    "เมื่อผู้ใช้บริการทำข้อตกลงใดๆ หรือให้ข้อมูลสำหรับติดต่อระหว่างผู้ใช้บริการกับบริษัท",
    "เมื่อผู้ใช้บริการทำการเติมเงินด้วยช่องทางการชำระเงินของทางบริษัท",
    "เมื่อผู้ใช้บริการทำการซื้อสินค้าและ/หรือบริการบนแพลตฟอร์มของบริษัท",
    "เมื่อผู้ใช้บริการได้อนุญาตให้บริษัทเข้าถึงบัญชีโซเชียลมีเดียของผู้ใช้บริการ หรือเข้าสู่ระบบด้วยบัญชีโซเชียลมีเดีย ภายใต้ข้อกำหนดของแพลตฟอร์มโซเชียลมีเดีย"
];

export default pdpa
